import React from 'react';
import {motion} from "framer-motion";

import styles from './TradeSteps.module.scss'
import {opacityXMinusVariant, opacityYVariant} from "../../../../constants/animation-variants/opacityVariant";

const alertAnimation = {
    visible: {
        scaleX: 1,
        transition: {
            duration: 0.5
        }
    },
    hidden: {
        scaleX: 0,
    }
}

const TradeSteps = () => {
    return (
        <div className={styles.trade_steps}>
            <motion.h3 whileInView={'visible'} initial={'hidden'} viewport={{once: true}} variants={opacityXMinusVariant}  className={styles.trade_steps__title}>Порядок дій обміну або повернення товару:</motion.h3>
            <div className={styles.trade_steps__info}>
                <motion.div className={styles.trade_steps__info_block} whileInView={'visible'} initial={'hidden'} viewport={{once: true, amount: 0.5}}>
                    <motion.svg variants={opacityYVariant} width="85" height="85" viewBox="0 0 85 85" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M41.0827 59.5H32.5827C31.8003 59.5 31.166 60.1343 31.166 60.9167V68C31.166 68.7824 31.8003 69.4167 32.5827 69.4167H41.0827C41.865 69.4167 42.4993 68.7824 42.4993 68V60.9167C42.4993 60.1343 41.865 59.5 41.0827 59.5ZM39.666 66.5833H33.9993V62.3333H39.666V66.5833Z" fill="#BF0B0B"/>
                        <path d="M70.8333 60.9166H68V63.75H70.8333V60.9166Z" fill="#BF0B0B"/>
                        <path d="M79.3327 60.9166H73.666V63.75H79.3327V60.9166Z" fill="#BF0B0B"/>
                        <path d="M79.3333 66.5834H68V69.4167H79.3333V66.5834Z" fill="#BF0B0B"/>
                        <path d="M84.9901 22.6156C84.9841 22.4665 84.9545 22.3192 84.9022 22.1793C84.8895 22.1481 84.8824 22.1155 84.8682 22.0858C84.8541 22.056 84.8597 22.0504 84.8512 22.0334L79.1846 10.7C78.9446 10.2198 78.4536 9.91645 77.9167 9.91663H32.5833C32.0464 9.91645 31.5554 10.2198 31.3154 10.7L25.6487 22.0334C25.6402 22.0504 25.6388 22.0688 25.6303 22.0858C25.6218 22.1028 25.6105 22.1481 25.5977 22.1793C25.5455 22.3192 25.5159 22.4665 25.5099 22.6156C25.5099 22.6326 25.5 22.6482 25.5 22.6666V29.75H0V32.5833H25.5V35.4166H5.66667V38.25H25.5V73.6666C25.5 74.449 26.1343 75.0833 26.9167 75.0833H83.5833C84.3657 75.0833 85 74.449 85 73.6666V22.6666C85 22.6482 84.9901 22.634 84.9901 22.6156ZM77.0412 12.75L81.2912 21.25H62.1662L61.1037 12.75H77.0412ZM52.2509 12.75H58.2491L59.3116 21.25H51.1884L52.2509 12.75ZM51 24.0833H59.5V41.0833H51V24.0833ZM33.4574 12.75H49.3949L48.3324 21.25H29.2074L33.4574 12.75ZM82.1667 72.25H28.3333V38.25H36.8333V35.4166H28.3333V32.5833H36.8333V29.75H28.3333V24.0833H48.1667V42.5C48.1667 43.2823 48.801 43.9166 49.5833 43.9166H60.9167C61.699 43.9166 62.3333 43.2823 62.3333 42.5V24.0833H82.1667V72.25Z" fill="#BF0B0B"/>
                        <path d="M22.6667 53.8334H0V56.6667H22.6667V53.8334Z" fill="#BF0B0B"/>
                        <path d="M22.666 59.5H5.66602V62.3333H22.666V59.5Z" fill="#BF0B0B"/>
                    </motion.svg>

                    <motion.p variants={opacityXMinusVariant}>Якщо ушкодження виявлене не в присутності працівника служби доставки, то потрібно зателефонувати за номером +38099999999999 та повідомити про пошкодженяя замовлення, потім відправити товар за вказаною нижче адресою та повідомити нам номер товарної накладної.</motion.p>
                </motion.div>

                <motion.div className={styles.trade_steps__info_block} whileInView={'visible'} initial={'hidden'} viewport={{once: true, amount: 0.5}}>
                    <motion.svg variants={opacityYVariant} width="84" height="84" viewBox="0 0 84 84" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M82.6875 28.266C82.6875 24.9834 80.0166 22.3125 76.734 22.3125C75.1446 22.3125 73.6483 22.932 72.5248 24.0568L68.6346 27.9471L64.3125 32.2691V19.5825C68.7579 18.942 72.1875 15.1187 72.1875 10.5C72.1875 5.43375 68.0663 1.3125 63 1.3125H10.5C5.43375 1.3125 1.3125 5.43375 1.3125 10.5V76.125C1.3125 76.8495 1.9005 77.4375 2.625 77.4375H9.1875V81.375C9.1875 82.0995 9.7755 82.6875 10.5 82.6875H63C63.7245 82.6875 64.3125 82.0995 64.3125 81.375V49.1059L77.0529 36.3654L78.4009 35.0175C77.721 38.4038 76.0633 41.517 73.5669 44.0147L67.3234 50.2583L69.1793 52.1141L75.4228 45.8706C79.1477 42.1457 81.2306 37.2264 81.3527 31.9778C82.2019 30.9251 82.6875 29.6389 82.6875 28.266ZM74.3807 25.9127C75.0094 25.284 75.8454 24.9375 76.734 24.9375C78.5689 24.9375 80.0625 26.4311 80.0625 28.266C80.0625 29.1546 79.716 29.9906 79.0873 30.6193L76.125 33.5816L71.4184 28.875L74.3807 25.9127ZM69.5625 30.7309L70.9879 32.1562L54.4688 48.6754L53.0434 47.25L69.5625 30.7309ZM38.3473 65.3664L41.0471 59.9655L45.0345 63.9529L39.6336 66.6527L38.3473 65.3664ZM42.5434 57.75L51.1875 49.1059L55.8941 53.8125L47.25 62.4566L42.5434 57.75ZM63 3.9375C66.6186 3.9375 69.5625 6.88144 69.5625 10.5C69.5625 14.1186 66.6186 17.0625 63 17.0625H16.9181C18.6244 15.393 19.6875 13.0699 19.6875 10.5C19.6875 7.93013 18.6244 5.607 16.9181 3.9375H63ZM11.8125 16.9299V13.125C11.8125 12.4018 12.4018 11.8125 13.125 11.8125H16.9299C16.4062 14.3798 14.3798 16.4062 11.8125 16.9299ZM3.9375 74.8125V10.5C3.9375 6.88144 6.88144 3.9375 10.5 3.9375C13.6684 3.9375 16.3196 6.19631 16.9299 9.1875H13.125C10.9541 9.1875 9.1875 10.9541 9.1875 13.125V74.8125H3.9375ZM61.6875 80.0625H11.8125V19.6875H61.6875V34.8941L55.8941 40.6875H17.0625V43.3125H53.2691L50.6441 45.9375H17.0625V48.5625H48.0191L39.7596 56.8221C39.6572 56.9244 39.5903 57.0465 39.5286 57.1699L39.5141 57.162L35.5766 65.037C35.3246 65.5423 35.4231 66.1526 35.8234 66.5516L36.2066 66.9375L33.1971 69.9471L35.0529 71.8029L38.0625 68.7934L38.4471 69.1779C38.6991 69.4299 39.0351 69.5625 39.375 69.5625C39.5732 69.5625 39.7753 69.5166 39.9617 69.4247L47.8367 65.4872L47.8288 65.4727C47.9522 65.4111 48.0743 65.3441 48.1766 65.2417L58.6766 54.7417L61.6875 51.7309V80.0625ZM57.75 51.9566L56.3246 50.5312L72.8438 34.0121L74.2691 35.4375L57.75 51.9566Z" fill="#BF0B0B"/>
                        <path d="M17.0625 24.9375H56.4375V27.5625H17.0625V24.9375Z" fill="#BF0B0B"/>
                        <path d="M17.0625 30.1875H56.4375V32.8125H17.0625V30.1875Z" fill="#BF0B0B"/>
                        <path d="M17.0625 35.4375H56.4375V38.0625H17.0625V35.4375Z" fill="#BF0B0B"/>
                        <path d="M17.0625 66.9375H31.5V69.5625H17.0625V66.9375Z" fill="#BF0B0B"/>
                        <path d="M17.0625 72.1875H56.4375V74.8125H17.0625V72.1875Z" fill="#BF0B0B"/>
                    </motion.svg>


                    <motion.p variants={opacityXMinusVariant}>Заповнити Акт про пошкодження товару у присутності представника Нової Пошти і надати нам інформацію про цей акт та його номер по телефону +3809999999999, вказавши також кільість пошкодженого товару.</motion.p>
                </motion.div>
            </div>

            <motion.div initial={'hidden'} whileInView={'visible'} variants={alertAnimation} viewport={{amount: 0.2, once: true}} className={styles.trade_steps__alert}>
                <div>
                    <svg width="29" height="23" viewBox="0 0 29 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M11.4315 22.9338C17.2434 22.9338 21.9548 18.5263 21.9548 13.0894C21.9548 7.65248 17.2434 3.245 11.4315 3.245C5.61965 3.245 0.908203 7.65248 0.908203 13.0894C0.908203 18.5263 5.61965 22.9338 11.4315 22.9338Z" fill="#BF0B0B" fillOpacity="0.1"/>
                        <path d="M11.5513 20.6984L11.4178 20.4856C9.37897 17.236 3.96101 10.3396 3.90628 10.2704L3.82812 10.1711L5.674 8.46451L11.517 12.2813C15.1959 7.81536 18.6281 4.74794 20.8669 2.95669C23.316 0.997235 24.9101 0.0951675 24.9262 0.0865233L24.9625 0.0662231H28.0936L27.7945 0.3154C20.1024 6.72474 11.765 20.3472 11.6819 20.484L11.5513 20.6984Z" fill="#BF0B0B"/>
                    </svg>
                    <p>Доставка товара при Поверненні або Обміні здійснюється за рахунок интернет-магазину.</p>
                </div>
                <div>
                    <svg width="29" height="23" viewBox="0 0 29 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M11.4315 22.9338C17.2434 22.9338 21.9548 18.5263 21.9548 13.0894C21.9548 7.65248 17.2434 3.245 11.4315 3.245C5.61965 3.245 0.908203 7.65248 0.908203 13.0894C0.908203 18.5263 5.61965 22.9338 11.4315 22.9338Z" fill="#BF0B0B" fillOpacity="0.1"/>
                        <path d="M11.5513 20.6984L11.4178 20.4856C9.37897 17.236 3.96101 10.3396 3.90628 10.2704L3.82812 10.1711L5.674 8.46451L11.517 12.2813C15.1959 7.81536 18.6281 4.74794 20.8669 2.95669C23.316 0.997235 24.9101 0.0951675 24.9262 0.0865233L24.9625 0.0662231H28.0936L27.7945 0.3154C20.1024 6.72474 11.765 20.3472 11.6819 20.484L11.5513 20.6984Z" fill="#BF0B0B"/>
                    </svg>
                    <p>Повернення грошових коштів буде здійснено на протязі 7 днів з дня отримання продукції на склад та тим способом оплати, яким здійснювалась покупка.</p>
                </div>
                <div>
                    <svg width="29" height="23" viewBox="0 0 29 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M11.4315 22.9338C17.2434 22.9338 21.9548 18.5263 21.9548 13.0894C21.9548 7.65248 17.2434 3.245 11.4315 3.245C5.61965 3.245 0.908203 7.65248 0.908203 13.0894C0.908203 18.5263 5.61965 22.9338 11.4315 22.9338Z" fill="#BF0B0B" fillOpacity="0.1"/>
                        <path d="M11.5513 20.6984L11.4178 20.4856C9.37897 17.236 3.96101 10.3396 3.90628 10.2704L3.82812 10.1711L5.674 8.46451L11.517 12.2813C15.1959 7.81536 18.6281 4.74794 20.8669 2.95669C23.316 0.997235 24.9101 0.0951675 24.9262 0.0865233L24.9625 0.0662231H28.0936L27.7945 0.3154C20.1024 6.72474 11.765 20.3472 11.6819 20.484L11.5513 20.6984Z" fill="#BF0B0B"/>
                    </svg>
                    <p>Обмін товару здійснюється на протязі 1-3 днів з моменту його отримання на склад.</p>
                </div>
            </motion.div>
        </div>
    );
};
export default TradeSteps;